const fs = require('fs');
const path = require('path');

const appCategories = [
    "摸鱼神器","摸鱼游戏","资源站","Ai网站","社区论坛","个人博客",
    "iOS", "Android", "HarmonyOS", "web", "桌面端", "Mac", "Windows", "Linux", "小程序", "智能电视", "智能手表", "车载系统", "AR/VR",
    "社交网络", "即时通讯", "视频直播", "短视频", "音乐播放", "音频娱乐", "游戏", "摄影摄像", "图片编辑", "视频编辑",
    "外卖点餐", "出行打车", "酒店预订", "旅游攻略", "地图导航", "生活缴费", "二手交易", "家政服务", "宠物服务", "医疗服务",
    "在线教育", "语言学习", "笔记工具", "思维导图", "办公软件", "项目管理", "团队协作", "效率工具", "文档编辑", "电子阅读",
    "移动支付", "网上银行", "股票基金", "保险服务", "记账理财", "信用卡管理",
    "系统工具", "安全防护", "网络加速", "文件管理", "压缩解压", "翻译工具", "天气预报", "计算器", "时钟日历", "健康运动",
    "早教启蒙", "儿童游戏", "动画漫画", "学习工具", "考试备考", "校园生活", "职场社交", "健康养生", "休闲娱乐", "生活服务",
    "中文", "英文", "中国大陆", "港澳台", "海外", "免费", "付费", "内购", "高频更新", "中频更新", "低频更新", "独立开发者", "开源项目",
    "生产力", "开发者工具", "技术", "时尚", "金融", "旅行", "招聘", "搞笑", "开源", "人工智能", "统计分析", "网页应用", "Apple", "健康与健身", "表情符号", "增强现实", "家庭", "新闻", "社交媒体工具", "营销", "设计工具", "用户体验", "视频流", "硬件", "Android安卓", "iPhone", "区块链", "艺术", "摄影", "闹钟", "日历和日程安排", "品牌", "SaaS", "电子商务", "冒险游戏", "独立游戏", "益智游戏", "免费游戏", "Apple Watch", "GitHub", "机器人", "消息", "写作工具", "电子表格", "教育", "Firefox 扩展", "电影", "电视", "iPad", "虚拟助手", "无人机", "Chrome 扩展", "VR", "电子邮件", "法律", "复古游戏", "壁纸", "图书", "任务管理", "冥想", "广告", "草图", "棋盘游戏", "物联网", "电报", "隐私", "谷歌", "活动", "文字编辑", "篮球", "时间跟踪", "地图", "天气应用", "体育", "CSM 工具", "SEO 工具", "策略游戏", "冲浪", "电子邮件简报", "烹饪", "历史书籍", "动作类游戏", "艺术书籍", "图标", "匿名", "搞笑游戏", "战斗游戏", "原型", "漫画与图画小说", "纸牌游戏", "户外", "广告拦截", "汽车", "3D 打印", "无线上网", "网游", "Safari 扩展", "模拟游戏", "移动和存储", "首饰", "平台游戏", "制作游戏", "文字游戏", "RPG 游戏", "足球", "名人", "小说", "恐怖书籍", "桌面游戏", "幻想游戏", "网球", "体育游戏", "恐怖游戏", "拳击", "科幻游戏", "惊悚书籍", "星球大战", "犯罪书籍", "驾驶游戏", "等距游戏", "历史游戏", "FPS 游戏", "流行书籍", "PS VR", "模拟器", "社交", "效率", "商务", "工具", "购物", "摄影与录像", "生活", "参考", "财务", "软件开发工具", "图片", "远程工作工具", "音频和语音", "多元化", "参考资料", "Web3", "API", "Chrome 扩展程序", "浏览器扩展", "社区", "搜索", "时事通讯", "数据科学", "会议工具", "日历", "语言", "数据库", "社交媒体市场营销", "个人财务", "声音", "在线学习", "职业", "视频", "娱乐", "古典音乐", "设计", "健康", "用户体验设计", "菜单栏应用", "3D建模", "儿童与育儿", "数字艺术", "图形与设计", "设计资源", "数据", "生活方式", "插图", "影像艺术", "照片编辑", "数据与分析", "会计", "网页设计", "营养", "咨询", "聊天室", "电脑", "天气", "安全", "动画片", "手机", "去中心化APP", "收音机", "酒店", "喜剧", "线框图", "运营", "商业书籍", "设计模板", "家具", "科学", "赛车", "自然", "摩托车", "信用卡", "农业", "婴儿", "平面设计", "电子音乐", "DIY", "绘画", "室内设计", "二次元", "白噪音", "小米"
  ];

  const appTags = []


  for (let i = 0; i < appCategories.length; i++) {
    const tag = {
        tag_name: appCategories[i],
        tag_color: "",
        tag_icon: "",
        app_num: 0,
        status: 1,
        other:[],
        createdAt:new Date().toISOString().replace('T','').replace('Z', ''), 
        updatedAt:new Date().toISOString().replace('T','').replace('Z', '')
    }
    appTags.push(tag)
  }

  const appTagsJson = JSON.stringify(appTags, null, 2);
  fs.writeFileSync(path.join(__dirname, 'app_tags.json'), appTagsJson);